<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:buildbot@teneleven-slave.macports.org" />
</head>

<body>



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a></li>
  <li><a href="#Perl">Perl&#xC5D0; &#xAD00;&#xD558;&#xC5EC;</a></li>
  <li><a href="#">&#xC124;&#xCE58;</a></li>
  <li><a href="#1">&#xC2E4;&#xD589;&#xC5D0; &#xC5B4;&#xB824;&#xC6C0;&#xC744; &#xACAA;&#xB294;&#xB2E4;&#xBA74;</a></li>
  <li><a href="#2">&#xC778;&#xCF54;&#xB529;</a>
    <ul>
      <li><a href="#Encode">Encode &#xBAA8;&#xB4C8;</a>
        <ul>
          <li><a href="#3">&#xC9C0;&#xC6D0; &#xC778;&#xCF54;&#xB529;</a></li>
          <li><a href="#4">&#xBCC0;&#xD658; &#xC608;&#xC81C;</a></li>
          <li><a href="#5">&#xBAA8;&#xBC94; &#xC0AC;&#xB840;</a></li>
          <li><a href="#6">&#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xBC0F; &#xD55C;&#xAD6D;&#xC5B4; &#xC778;&#xCF54;&#xB529; &#xAD00;&#xB828; &#xC790;&#xB8CC;</a></li>
        </ul>
      </li>
    </ul>
  </li>
  <li><a href="#Perl1">Perl &#xAD00;&#xB828; &#xC790;&#xB8CC;</a></li>
  <li><a href="#7">&#xB77C;&#xC774;&#xC13C;&#xC2A4;</a></li>
  <li><a href="#AUTHORS">AUTHORS</a></li>
</ul>

<p>&#xC774; &#xD30C;&#xC77C;&#xC744; &#xB0B4;&#xC6A9; &#xADF8;&#xB300;&#xB85C; &#xC77D;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xC6B0;&#xC2A4;&#xAF5D;&#xC2A4;&#xB7EC;&#xC6B4; &#xBB38;&#xC790;&#xB294; &#xBB34;&#xC2DC;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xC774; &#xBB38;&#xC11C;&#xB294; POD&#xB85C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB3C4;&#xB85D; POD &#xD615;&#xC2DD;(<i>pod/perlpod.pod</i> &#xBB38;&#xC11C;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC138;&#xC694;)&#xC73C;&#xB85C; &#xC791;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<h1 id="NAME">NAME</h1>

<p>perlko - &#xD55C;&#xAD6D;&#xC5B4; Perl &#xC548;&#xB0B4;&#xC11C;</p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>Perl&#xC758; &#xC138;&#xACC4;&#xC5D0; &#xC624;&#xC2E0; &#xAC83;&#xC744; &#xD658;&#xC601;&#xD569;&#xB2C8;&#xB2E4;!</p>

<p>Perl&#xC740; &#xAC00;&#xB054; <b>&#39;Practical Extraction and Report Language&#39;</b>&#xB77C;&#xACE0; &#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;&#xB9CC; &#xB2E4;&#xB978; &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC9C4; &#xAC83;&#xB4E4; &#xC911;&#xC5D0;&#xC11C; <b>&#39;Pathologically Eclectic Rubbish Lister&#39;</b>&#xB77C;&#xACE0; &#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xC774;&#xAC83;&#xC740; &#xB07C;&#xC6CC; &#xB9DE;&#xCD98; &#xAC83;&#xC774;&#xBA70; Perl&#xC774; &#xC774;&#xAC83;&#xB4E4;&#xC758; &#xCCAB; &#xAE00;&#xC790;&#xB97C; &#xAC00;&#xC838;&#xC640;&#xC11C; &#xC774;&#xB984;&#xC744; &#xBD99;&#xC778; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. Perl&#xC758; &#xCC3D;&#xC2DC;&#xC790; Larry&#xAC00; &#xCCAB; &#xBC88;&#xC9F8; &#xC774;&#xB984;&#xC744; &#xBA3C;&#xC800; &#xC0DD;&#xAC01;&#xD588;&#xACE0; &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC9C4; &#xAC83;&#xC744; &#xB098;&#xC911;&#xC5D0; &#xC9C0;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <b>&#39;Perl&#39;</b>&#xC740; &#xBAA8;&#xB450; &#xB300;&#xBB38;&#xC790;&#xAC00; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC9C4; &#xC5B4;&#xB5A4; &#xAC83;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xB17C;&#xC7C1;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC758;&#xBBF8;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. Larry&#xB294; &#xB450; &#xAC1C; &#xB2E4; &#xC9C0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</p>

<p>&#xAC00;&#xB054; p&#xAC00; &#xC18C;&#xBB38;&#xC790;&#xB85C; &#xC791;&#xC131;&#xB41C; <b>&#39;perl&#39;</b>&#xC744; &#xBCFC; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. P&#xAC00; &#xB300;&#xBB38;&#xC790;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB294; <b>&#39;Perl&#39;</b>&#xC740; &#xC5B8;&#xC5B4;&#xB97C; &#xCC38;&#xC870;&#xD560; &#xB54C; &#xC4F0;&#xC774;&#xBA70; <b>&#39;perl&#39;</b>&#xCC98;&#xB7FC; p&#xAC00; &#xC18C;&#xBB38;&#xC790;&#xC778; &#xACBD;&#xC6B0;&#xB294; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xACE0; &#xB3CC;&#xB9B4; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD574;&#xC11D;&#xAE30;&#xB97C; &#xC9C0;&#xCE6D;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>

<h1 id="Perl">Perl&#xC5D0; &#xAD00;&#xD558;&#xC5EC;</h1>

<p>Perl&#xC740; &#xBCF8;&#xB798; &#xBB38;&#xC790;&#xC5F4; &#xC0DD;&#xC131;&#xC744; &#xC704;&#xD574; &#xB9CC;&#xB4E4;&#xC84C;&#xC9C0;&#xB9CC; &#xC9C0;&#xAE08;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xAD00;&#xB9AC;&#xC640; &#xC6F9; &#xAC1C;&#xBC1C;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;, GUI &#xAC1C;&#xBC1C; &#xB4F1;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xC5EC;&#xB7EC; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBC94;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;.</p>

<p>&#xC774; &#xC5B8;&#xC5B4;&#xB294; &#xC544;&#xB984;&#xB2E4;&#xC6C0;(&#xC544;&#xC8FC; &#xC791;&#xACE0;, &#xC6B0;&#xC544;&#xD558;&#xACE0;, &#xC544;&#xC8FC; &#xC801;&#xACE0;)&#xBCF4;&#xB2E4; &#xC2E4;&#xC6A9;&#xC801;(&#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC27D;&#xACE0;, &#xD6A8;&#xC728;&#xC801;&#xC774;&#xBA70;, &#xAC00;&#xB2A5;&#xD55C; &#xCD5C;&#xB300;&#xD55C;)&#xC778; &#xAC83;&#xC744; &#xC9C0;&#xD5A5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC27D;&#xACE0;, &#xC808;&#xCC28;&#xC801; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xACFC; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBAA8;&#xB450; &#xC9C0;&#xC6D0;&#xD558;&#xACE0;, &#xAC15;&#xB825;&#xD55C; &#xBB38;&#xC790;&#xC5F4; &#xCC98;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xB0B4;&#xC7A5;&#xD558;&#xACE0;, &#xC138;&#xC0C1;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC778;&#xC0C1;&#xC801;&#xC778; &#xC81C; 3&#xC790;&#xC758; &#xBAA8;&#xB4C8; &#xBAA8;&#xC74C;&#xCC98;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC740; Perl&#xC758; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xD2B9;&#xC9D5;&#xC785;&#xB2C8;&#xB2E4;.</p>

<p>Perl&#xC758; &#xC5B8;&#xC5B4;&#xC801; &#xD2B9;&#xC9D5;&#xC740; <i>pod/perlintro.pod</i> &#xBB38;&#xC11C;&#xC5D0;&#xC11C; &#xC18C;&#xAC1C;&#xD569;&#xB2C8;&#xB2E4;.</p>

<p>&#xC774;&#xBC88; &#xB9B4;&#xB9AC;&#xC2A4;&#xC5D0;&#xC11C; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xBCC0;&#xD654;&#xB294; <i>pod/perldelta.pod</i>&#xC5D0;&#xC11C; &#xB17C;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>

<p>&#xB610;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xCD9C;&#xD310;&#xC0AC;&#xAC00; &#xCD9C;&#xD310;&#xD55C; &#xB9CE;&#xC740; Perl &#xCC45;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xC8FC;&#xC81C;&#xB97C; &#xB2E4;&#xB8E8;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC790;&#xC138;&#xD55C; &#xC815;&#xBCF4;&#xB294; <i>pod/perlbook.pod</i> &#xBB38;&#xC11C;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC138;&#xC694;.</p>

<h1 id="">&#xC124;&#xCE58;</h1>

<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xBE44;&#xAD50;&#xC801; &#xD604;&#xB300;&#xC758; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xACE0; &#xD604;&#xC7AC; &#xBC84;&#xC804;&#xC758; Perl&#xC744; &#xC9C0;&#xC5ED;&#xC801;&#xC73C;&#xB85C; &#xC124;&#xCE58;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xB2E4;&#xC74C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC138;&#xC694;.</p>

<pre><code>    ./Configure -des -Dprefix=$HOME/localperl
    make test
    make install</code></pre>

<p>&#xC55E;&#xC758; &#xBA85;&#xB839;&#xC740; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB9DE;&#xAC8C; &#xD658;&#xACBD;&#xC744; &#xC124;&#xC815;&#xD558;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xC744; &#xC218;&#xD589;&#xD55C; &#xD6C4;, &#xD68C;&#xAE30; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC218;&#xD589;&#xD55C;&#xB4A4;, &#xD648; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xD558;&#xBD80;&#xC758; <i>localperl</i> &#xB514;&#xB809;&#xD130;&#xB9AC;&#xC5D0; perl&#xC744; &#xC124;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</p>

<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC5B4;&#xB5A0;&#xD55C; &#xBB38;&#xC81C;&#xB4E0; &#xACAA;&#xAC8C; &#xB418;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xC758; &#xBC84;&#xC804; Perl&#xC744; &#xC124;&#xCE58;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xB2E4;&#xBA74; &#xD604;&#xC7AC; &#xBC30;&#xD3EC;&#xD310;&#xC5D0; &#xB4E4;&#xC5B4;&#xC788;&#xB294; <i>INSTALL</i> &#xD30C;&#xC77C; &#xC548;&#xC758; &#xC790;&#xC138;&#xD55C; &#xC124;&#xBA85;&#xC744; &#xC77D;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC77C;&#xBC18;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C; Perl&#xC744; &#xBE4C;&#xB4DC;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD55C; &#xB3C4;&#xC6C0;&#xB9D0;&#xACFC; &#xADC0;&#xB754;&#xC774; &#xC801;&#xD600;&#xC788;&#xB294; &#xB9CE;&#xC740; &#xC218;&#xC758; <i>README</i> &#xD30C;&#xC77C;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<p>&#xC77C;&#xB2E8; Perl&#xC744; &#xC124;&#xCE58;&#xD558;&#xACE0; &#xB098;&#xBA74; <code>perldoc</code> &#xB3C4;&#xAD6C;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xD48D;&#xBD80;&#xD55C; &#xBB38;&#xC11C;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xB2E4;&#xC74C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC138;&#xC694;.</p>

<pre><code>    perldoc perl</code></pre>

<h1 id="1">&#xC2E4;&#xD589;&#xC5D0; &#xC5B4;&#xB824;&#xC6C0;&#xC744; &#xACAA;&#xB294;&#xB2E4;&#xBA74;</h1>

<p>Perl&#xC740; &#xB728;&#xAC1C;&#xC9C8;&#xC5D0;&#xC11C; &#xBD80;&#xD130; &#xB85C;&#xCF13; &#xACFC;&#xD559;&#xAE4C;&#xC9C0; &#xBAA8;&#xB4E0; &#xBD84;&#xC57C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xD06C;&#xACE0; &#xBCF5;&#xC7A1;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC5B4;&#xB824;&#xC6C0;&#xC5D0; &#xBD80;&#xB52A;&#xD614;&#xC744;&#xB54C; &#xADF8; &#xBB38;&#xC81C;&#xB294; &#xC774;&#xBBF8; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC774; &#xD574;&#xACB0;&#xD588;&#xC744; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC11C;&#xB97C; &#xBAA8;&#xB450; &#xD655;&#xC778;&#xD588;&#xB294;&#xB370;&#xB3C4; &#xBC84;&#xADF8;&#xAC00; &#xD655;&#xC2E4;&#xD558;&#xB2E4;&#xBA74; <code>perlbug</code> &#xB3C4;&#xAD6C;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC800;&#xD76C;&#xC5D0;&#xAC8C; &#xBC84;&#xADF8;&#xB97C; &#xBCF4;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;. <code>perlbug</code>&#xC5D0; &#xB300;&#xD55C; &#xB354; &#xC790;&#xC138;&#xD55C; &#xC815;&#xBCF4;&#xB294; <code>perldoc perlbug</code> &#xB610;&#xB294; <code>perlbug</code>&#xB97C; &#xBA85;&#xB839;&#xC904;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD574;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<p>Perl&#xC744; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4; &#xD558;&#xB354;&#xB77C;&#xB3C4; Perl&#xC740; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xC9C4;&#xD654;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xB9DE;&#xB2E5;&#xB728;&#xB9B0; &#xBC84;&#xADF8;&#xB97C; &#xC218;&#xC815;&#xD588;&#xAC70;&#xB098; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC720;&#xC6A9;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD560;&#xBC95;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xB2A5;&#xC774; &#xCD94;&#xAC00;&#xB41C; &#xC880; &#xB354; &#xCD5C;&#xC2E0; &#xBC84;&#xC804;&#xC774; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<p>&#xC5EC;&#xB7EC;&#xBD84;&#xC740; &#xD56D;&#xC0C1; &#xCD5C;&#xC2E0; &#xBC84;&#xC804;&#xC758; perl&#xC744; CPAN (Comprehensive Perl Archive Network) &#xC0AC;&#xC774;&#xD2B8; <a href="http://www.cpan.org/src/">http://www.cpan.org/src/</a> &#xC5D0;&#xC11C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<p>perl &#xC18C;&#xC2A4;&#xC5D0; &#xAC04;&#xB2E8;&#xD55C; &#xD328;&#xCE58;&#xB97C; &#xB4F1;&#xB85D;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; <i>pod/perlhack.pod</i> &#xBB38;&#xC11C;&#xC758; <b>&quot;SUPER QUICK PATCH GUIDE&quot;</b>&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC138;&#xC694;.</p>

<p>&#xADF8;&#xB0E5; &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;. &#xC81C;&#xAC00; &#xC774;&#xAC83;&#xCC98;&#xB7FC; &#xBA4B;&#xC9C4; &#xBB3C;&#xAC74;&#xC744; &#xB9CC;&#xB4E0;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC5EC;&#xB7EC;&#xBD84;&#xC774; &#xC54C;&#xAE30;&#xB97C; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC83;&#xC740; &#xC81C; &#xC774;&#xC57C;&#xAE30;&#xC758; <b>&quot;&#xC800;&#xC790;(Author)&quot;</b>&#xB97C; &#xAE30;&#xC058;&#xAC8C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xC774; &#xC5EC;&#xB7EC;&#xBD84;&#xC744; &#xADC0;&#xCC2E;&#xAC8C; &#xD55C;&#xB2E4;&#xBA74; &#xC5EC;&#xB7EC;&#xBD84;&#xC758; <b>&quot;&#xC800;&#xC791;(Authorship)&quot;</b>&#xC5D0; &#xB300;&#xD55C; &#xC0DD;&#xAC01;&#xC744; &#xC815;&#xC815;&#xD574;&#xC57C; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5B4;&#xCA0C;&#xAC70;&#xB098; &#xC5EC;&#xB7EC;&#xBD84;&#xC740; Perl&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xB2F5;&#xB2C8;&#xB2E4;. :-)</p>

<p>- <b>&quot;&#xC800;&#xC790;&quot;</b>&#xB85C;&#xBD80;&#xD130;.</p>

<h1 id="2">&#xC778;&#xCF54;&#xB529;</h1>

<p>Perl&#xC740; 5.8.0&#xD310;&#xBD80;&#xD130; &#xC720;&#xB2C8;&#xCF54;&#xB4DC;/ISO 10646&#xC5D0; &#xB300;&#xD574; &#xAD11;&#xBC94;&#xC704;&#xD558;&#xAC8C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xC9C0;&#xC6D0;&#xC758; &#xC77C;&#xD658;&#xC73C;&#xB85C; &#xD55C;&#xC911;&#xC77C;&#xC744; &#xBE44;&#xB86F;&#xD55C; &#xC138;&#xACC4; &#xAC01;&#xAD6D;&#xC5D0;&#xC11C; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xC774;&#xC804;&#xC5D0; &#xC4F0;&#xACE0; &#xC788;&#xC5C8;&#xACE0; &#xC9C0;&#xAE08;&#xB3C4; &#xB110;&#xB9AC; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xB294; &#xC218;&#xB9CE;&#xC740; &#xC778;&#xCF54;&#xB529;&#xC744; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC720;&#xB2C8;&#xCF54;&#xB4DC;&#xB294; &#xC804; &#xC138;&#xACC4;&#xC5D0;&#xC11C; &#xC4F0;&#xC774;&#xB294; &#xBAA8;&#xB4E0; &#xC5B8;&#xC5B4;&#xB97C; &#xC704;&#xD55C; &#xD45C;&#xAE30; &#xCCB4;&#xACC4;(&#xC720;&#xB7FD;&#xC758; &#xB77C;&#xD2F4; &#xC54C;&#xD30C;&#xBCB3;, &#xD0A4;&#xB9B4; &#xC54C;&#xD30C;&#xBCB3;, &#xADF8;&#xB9AC;&#xC2A4; &#xC54C;&#xD30C;&#xBCB3;, &#xC778;&#xB3C4;&#xC640; &#xB3D9;&#xB0A8; &#xC544;&#xC2DC;&#xC544;&#xC758; &#xBE0C;&#xB77C;&#xBBF8; &#xACC4;&#xC5F4; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;, &#xC544;&#xB78D; &#xBB38;&#xC790;, &#xD788;&#xBE0C;&#xB9AC; &#xBB38;&#xC790;, &#xD55C;&#xC911;&#xC77C;&#xC758; &#xD55C;&#xC790;, &#xD55C;&#xAD6D;&#xC5B4;&#xC758; &#xD55C;&#xAE00;, &#xC77C;&#xBCF8;&#xC5B4;&#xC758; &#xAC00;&#xB098;, &#xBD81;&#xBBF8; &#xC778;&#xB514;&#xC548;&#xC758; &#xD45C;&#xAE30; &#xCCB4;&#xACC4; &#xB4F1;)&#xB97C; &#xC218;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBAA9;&#xD45C;&#xB85C; &#xD558;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAE30;&#xC874;&#xC5D0; &#xC4F0;&#xC774;&#xB358; &#xAC01; &#xC5B8;&#xC5B4; &#xBC0F; &#xAD6D;&#xAC00; &#xADF8;&#xB9AC;&#xACE0; &#xC6B4;&#xC601; &#xCCB4;&#xACC4;&#xC5D0; &#xACE0;&#xC720;&#xD55C; &#xBB38;&#xC790; &#xC9D1;&#xD569;&#xACFC; &#xC778;&#xCF54;&#xB529;&#xC5D0; &#xC4F8; &#xC218; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xAE00;&#xC790;&#xB294; &#xBB3C;&#xB860;&#xC774;&#xACE0; &#xAE30;&#xC874; &#xBB38;&#xC790; &#xC9D1;&#xD569;&#xC5D0;&#xC11C; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xB358; &#xC544;&#xC8FC; &#xB9CE;&#xC740; &#xAE00;&#xC790;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<p>Perl&#xC740; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xB2C8;&#xCF54;&#xB4DC;&#xB97C; &#xBB38;&#xC790; &#xD45C;&#xD604;&#xC744; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xBCF4;&#xB2E4; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xB9D0;&#xD558;&#xBA74; Perl &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC548;&#xC5D0;&#xC11C; UTF-8 &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xACE0;, &#xAC01;&#xC885; &#xD568;&#xC218;&#xC640; &#xC5F0;&#xC0B0;&#xC790;(&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC815;&#xADDC;&#xC2DD;, index, substr)&#xAC00; &#xBC14;&#xC774;&#xD2B8; &#xB2E8;&#xC704; &#xB300;&#xC2E0; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xAE00;&#xC790; &#xB2E8;&#xC704;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xB354; &#xC790;&#xC138;&#xD55C; &#xAC83;&#xC740; <i>pod/perlunicode.pod</i> &#xBB38;&#xC11C;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;. &#xC720;&#xB2C8;&#xCF54;&#xB4DC;&#xAC00; &#xB110;&#xB9AC; &#xBCF4;&#xAE09;&#xB418;&#xAE30; &#xC804;&#xC5D0; &#xB110;&#xB9AC; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xC5C8;&#xACE0;, &#xC5EC;&#xC804;&#xD788; &#xB110;&#xB9AC; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xB294; &#xAC01;&#xAD6D;/&#xAC01; &#xC5B8;&#xC5B4;&#xBCC4; &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; &#xC785;&#xCD9C;&#xB825;&#xC744; &#xD558;&#xACE0; &#xC774;&#xB4E4; &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; &#xB41C; &#xB370;&#xC774;&#xD130;&#xC640; &#xBB38;&#xC11C;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xAC83;&#xC744; &#xB3D5;&#xAE30; &#xC704;&#xD574; <a>Encode</a> &#xBAA8;&#xB4C8;&#xC774; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; <a>Encode</a> &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC218;&#xB9CE;&#xC740; &#xC778;&#xCF54;&#xB529; &#xC0AC;&#xC774;&#xC758; &#xBCC0;&#xD658;&#xC744; &#xC27D;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<h2 id="Encode">Encode &#xBAA8;&#xB4C8;</h2>

<h3 id="3">&#xC9C0;&#xC6D0; &#xC778;&#xCF54;&#xB529;</h3>

<p><a>Encode</a> &#xBAA8;&#xB4C8;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD55C;&#xAD6D;&#xC5B4; &#xC778;&#xCF54;&#xB529;&#xC744; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p>

<ul>

<li><p><code>euc-kr</code></p>

<p>US-ASCII&#xC640; KS X 1001&#xC744; &#xAC19;&#xC774; &#xC4F0;&#xB294; &#xBA40;&#xD2F0;&#xBC14;&#xC774;&#xD2B8; &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; &#xD754;&#xD788; &#xC644;&#xC131;&#xD615;&#xC774;&#xB77C;&#xACE0; &#xBD88;&#xB9BC;. KS X 2901&#xACFC; RFC 1557 &#xCC38;&#xACE0;.</p>

</li>
<li><p><code>cp949</code></p>

<p>MS-Windows 9x/ME&#xC5D0;&#xC11C; &#xC4F0;&#xC774;&#xB294; &#xD655;&#xC7A5; &#xC644;&#xC131;&#xD615;. euc-kr&#xC5D0; 8,822&#xC790;&#xC758; &#xD55C;&#xAE00; &#xC74C;&#xC808;&#xC744; &#xB354;&#xD55C; &#xAC83;&#xC784;. alias&#xB294; uhc, windows-949, x-windows-949, ks_c_5601-1987. &#xB9E8; &#xB9C8;&#xC9C0;&#xB9C9; &#xC774;&#xB984;&#xC740; &#xC801;&#xC808;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC774;&#xB984;&#xC774;&#xC9C0;&#xB9CC;, Microsoft &#xC81C;&#xD488;&#xC5D0;&#xC11C; CP949&#xC758; &#xC758;&#xBBF8;&#xB85C; &#xC4F0;&#xC774;&#xACE0; &#xC788;&#xC74C;.</p>

</li>
<li><p><code>johab</code></p>

<p>KS X 1001:1998 &#xBD80;&#xB85D; 3&#xC5D0;&#xC11C; &#xADDC;&#xC815;&#xD55C; &#xC870;&#xD569;&#xD615;. &#xBB38;&#xC790; &#xB808;&#xD37C;&#xD1A0;&#xB9AC;&#xB294; cp949&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; US-ASCII&#xC640; KS X 1001&#xC5D0; 8,822&#xC790;&#xC758; &#xD55C;&#xAE00; &#xC74C;&#xC808;&#xC744; &#xB354;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC740; &#xC804;&#xD600; &#xB2E4;&#xB984;.</p>

</li>
<li><p><code>iso-2022-kr</code></p>

<p>RFC 1557&#xC5D0;&#xC11C; &#xADDC;&#xC815;&#xD55C; &#xD55C;&#xAD6D;&#xC5B4; &#xC778;&#xD130;&#xB137; &#xBA54;&#xC77C; &#xAD50;&#xD658;&#xC6A9; &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; US-ASCII&#xC640; KS X 1001&#xC744; &#xB808;&#xD37C;&#xD1A0;&#xB9AC;&#xB85C; &#xD558;&#xB294; &#xC810;&#xC5D0;&#xC11C; euc-kr&#xACFC; &#xAC19;&#xC9C0;&#xB9CC; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC774; &#xB2E4;&#xB984;. 1997-8&#xB144; &#xACBD;&#xAE4C;&#xC9C0; &#xC4F0;&#xC600;&#xC73C;&#xB098; &#xB354; &#xC774;&#xC0C1; &#xBA54;&#xC77C; &#xAD50;&#xD658;&#xC5D0; &#xC4F0;&#xC774;&#xC9C0; &#xC54A;&#xC74C;.</p>

</li>
<li><p><code>ksc5601-raw</code></p>

<p>KS X 1001(KS C 5601)&#xC744; GL(&#xC989;, MSB&#xB97C; 0&#xC73C;&#xB85C; &#xD55C; &#xACBD;&#xC6B0;)&#xC5D0; &#xB193;&#xC558;&#xC744; &#xB54C;&#xC758; &#xC778;&#xCF54;&#xB529;. US-ASCII&#xC640; &#xACB0;&#xD569;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xB2E8;&#xB3C5;&#xC73C;&#xB85C; &#xC4F0;&#xC774;&#xB294; &#xC77C;&#xC740; X11 &#xB4F1;&#xC5D0;&#xC11C; &#xAE00;&#xAF34; &#xC778;&#xCF54;&#xB529;(ksc5601.1987-0. &#39;0&#39;&#xC740; GL&#xC744; &#xC758;&#xBBF8;&#xD568;)&#xC73C;&#xB85C; &#xC4F0;&#xC774;&#xB294; &#xAC83;&#xC744; &#xC81C;&#xC678;&#xD558;&#xACE0;&#xB294; &#xAC70;&#xC758; &#xC5C6;&#xC74C;. KS C 5601&#xC740; 1997&#xB144; KS X 1001&#xB85C; &#xC774;&#xB984;&#xC744; &#xBC14;&#xAFB8;&#xC5C8;&#xC74C;. 1998&#xB144;&#xC5D0;&#xB294; &#xB450; &#xAE00;&#xC790;(&#xC720;&#xB85C;&#xD654; &#xBD80;&#xD638;&#xC640; &#xB4F1;&#xB85D; &#xC0C1;&#xD45C; &#xBD80;&#xD638;)&#xAC00; &#xB354;&#xD574;&#xC84C;&#xC74C;.</p>

</li>
</ul>

<h3 id="4">&#xBCC0;&#xD658; &#xC608;&#xC81C;</h3>

<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, euc-kr &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; &#xB41C; &#xD30C;&#xC77C;&#xC744; UTF-8&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xB824;&#xBA74; &#xBA85;&#xB839;&#xC904;&#xC5D0;&#xC11C; &#xB2E4;&#xC74C;&#xCC98;&#xB7FC; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>

<pre><code>    perl -Mencoding=euc-kr,STDOUT,utf8 -pe1 &lt; file.euc-kr &gt; file.utf8</code></pre>

<p>&#xBC18;&#xB300;&#xB85C; &#xBCC0;&#xD658;&#xD560; &#xACBD;&#xC6B0; &#xB2E4;&#xC74C;&#xCC98;&#xB7FC; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>

<pre><code>    perl -Mencoding=utf8,STDOUT,euc-kr -pe1 &lt; file.utf8 &gt; file.euc-kr</code></pre>

<p>&#xC774;&#xB7F0; &#xBCC0;&#xD658;&#xC744; &#xC880;&#xB354; &#xD3B8;&#xB9AC;&#xD558;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC8FC;&#xB294; <i>piconv</i>&#xAC00; Perl&#xC5D0; &#xAE30;&#xBCF8;&#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xB294; <a>Encode</a> &#xBAA8;&#xB4C8;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xC21C;&#xC218; Perl &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xB85C; &#xC774;&#xB984;&#xC5D0;&#xC11C; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774; Unix&#xC758; <code>iconv</code>&#xB97C; &#xBAA8;&#xB378;&#xB85C; &#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xBC95;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

<pre><code>   piconv -f euc-kr -t utf8 &lt; file.euc-kr &gt; file.utf8
   piconv -f utf8 -t euc-kr &lt; file.utf8 &gt; file.euc-kr</code></pre>

<h3 id="5">&#xBAA8;&#xBC94; &#xC0AC;&#xB840;</h3>

<p>Perl&#xC740; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; UTF-8&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; Encode &#xBAA8;&#xB4C8;&#xC744; &#xD1B5;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xC778;&#xCF54;&#xB529;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0;&#xB9CC; &#xD56D;&#xC0C1; &#xB2E4;&#xC74C; &#xADDC;&#xCE59;&#xC744; &#xC9C0;&#xD0B4;&#xC73C;&#xB85C;&#xC368; &#xC778;&#xCF54;&#xB529;&#xACFC; &#xAD00;&#xB828;&#xD55C; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xBB38;&#xC81C;&#xC758; &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xC904;&#xC774;&#xB294; &#xAC83;&#xC744; &#xCD94;&#xCC9C;&#xD569;&#xB2C8;&#xB2E4;.</p>

<ul>

<li><p>&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB294; &#xD56D;&#xC0C1; UTF-8 &#xC778;&#xCF54;&#xB529;&#xC73C;&#xB85C; &#xC800;&#xC7A5;</p>

</li>
<li><p>&#xC18C;&#xC2A4; &#xCF54;&#xB4DC; &#xC0C1;&#xB2E8;&#xC5D0; <code>use utf8;</code> &#xD504;&#xB77C;&#xADF8;&#xB9C8; &#xC0AC;&#xC6A9;</p>

</li>
<li><p>&#xC18C;&#xC2A4; &#xCF54;&#xB4DC;, &#xD130;&#xBBF8;&#xB110;, &#xC6B4;&#xC601;&#xCCB4;&#xC81C;, &#xB370;&#xC774;&#xD130; &#xC778;&#xCF54;&#xB529;&#xC744; &#xBD84;&#xB9AC;&#xD574;&#xC11C; &#xC774;&#xD574;</p>

</li>
<li><p>&#xC785;&#xCD9C;&#xB825; &#xD30C;&#xC77C; &#xD578;&#xB4E4;&#xC5D0; &#xBA85;&#xC2DC;&#xC801;&#xC778; &#xC778;&#xCF54;&#xB529;&#xC744; &#xC0AC;&#xC6A9;</p>

</li>
<li><p>&#xC911;&#xBCF5;(double) &#xC778;&#xCF54;&#xB529;&#xC744; &#xC8FC;&#xC758;</p>

</li>
</ul>

<h3 id="6">&#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xBC0F; &#xD55C;&#xAD6D;&#xC5B4; &#xC778;&#xCF54;&#xB529; &#xAD00;&#xB828; &#xC790;&#xB8CC;</h3>

<ul>

<li><p><a href="/cperl/perluniintro.html">perluniintro</a></p>

</li>
<li><p><a href="/cperl/perlunicode.html">perlunicode</a></p>

</li>
<li><p><a>Encode</a></p>

</li>
<li><p><a>Encode::KR</a></p>

</li>
<li><p><a>encoding</a></p>

</li>
<li><p><a href="http://www.unicode.org/">http://www.unicode.org/</a></p>

<p>&#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xCEE8;&#xC18C;&#xC2DC;&#xC5C4;</p>

</li>
<li><p><a href="http://std.dkuug.dk/JTC1/SC2/WG2">http://std.dkuug.dk/JTC1/SC2/WG2</a></p>

<p>&#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; Unicode&#xC640; &#xAC19;&#xC740; ISO &#xD45C;&#xC900;&#xC778; ISO/IEC 10646 UCS(Universal Character Set)&#xC744; &#xB9CC;&#xB4DC;&#xB294; ISO/IEC JTC1/SC2/WG2&#xC758; &#xC6F9; &#xD398;&#xC774;&#xC9C0;</p>

</li>
<li><p><a href="http://www.cl.cam.ac.uk/~mgk25/unicode.html">http://www.cl.cam.ac.uk/~mgk25/unicode.html</a></p>

<p>&#xC720;&#xB2C9;&#xC2A4;/&#xB9AC;&#xB205;&#xC2A4; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC704;&#xD55C; UTF-8 &#xBC0F; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xAD00;&#xB828; FAQ</p>

</li>
<li><p><a href="http://wiki.kldp.org/Translations/html/UTF8-Unicode-KLDP/UTF8-Unicode-KLDP.html">http://wiki.kldp.org/Translations/html/UTF8-Unicode-KLDP/UTF8-Unicode-KLDP.html</a></p>

<p>&#xC720;&#xB2C9;&#xC2A4;/&#xB9AC;&#xB205;&#xC2A4; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC704;&#xD55C; UTF-8 &#xBC0F; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xAD00;&#xB828; FAQ&#xC758; &#xD55C;&#xAD6D;&#xC5B4; &#xBC88;&#xC5ED;</p>

</li>
</ul>

<h1 id="Perl1">Perl &#xAD00;&#xB828; &#xC790;&#xB8CC;</h1>

<p>&#xB2E4;&#xC74C;&#xC740; &#xACF5;&#xC2DD;&#xC801;&#xC778; Perl &#xAD00;&#xB828; &#xC790;&#xB8CC;&#xC911; &#xC77C;&#xBD80;&#xC785;&#xB2C8;&#xB2E4;.</p>

<ul>

<li><p><a href="http://www.perl.org/">http://www.perl.org/</a></p>

<p>Perl &#xACF5;&#xC2DD; &#xD648;&#xD398;&#xC774;&#xC9C0;</p>

</li>
<li><p><a href="http://www.perl.com/">http://www.perl.com/</a></p>

<p>O&#39;Reilly&#xC758; Perl &#xC6F9; &#xD398;&#xC774;&#xC9C0;</p>

</li>
<li><p><a href="http://www.cpan.org/">http://www.cpan.org/</a></p>

<p>CPAN - Comprehensive Perl Archive Network, &#xD1B5;&#xD569;&#xC801; Perl &#xD30C;&#xC77C; &#xBCF4;&#xAD00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;</p>

</li>
<li><p><a href="http://metacpan.org">http://metacpan.org</a></p>

<p>&#xBA54;&#xD0C0; CPAN</p>

</li>
<li><p><a href="http://lists.perl.org/">http://lists.perl.org/</a></p>

<p>Perl &#xBA54;&#xC77C;&#xB9C1; &#xB9AC;&#xC2A4;&#xD2B8;</p>

</li>
<li><p><a href="http://blogs.perl.org/">http://blogs.perl.org/</a></p>

<p>Perl &#xBA54;&#xD0C0; &#xBE14;&#xB85C;&#xADF8;</p>

</li>
<li><p><a href="http://www.perlmonks.org/">http://www.perlmonks.org/</a></p>

<p>Perl &#xC218;&#xB3C4;&#xC2B9;&#xB4E4;&#xC744; &#xC704;&#xD55C; &#xC218;&#xB3C4;&#xC6D0;</p>

</li>
<li><p><a href="http://www.pm.org/groups/asia.html">http://www.pm.org/groups/asia.html</a></p>

<p>&#xC544;&#xC2DC;&#xC544; &#xC9C0;&#xC5ED; Perl &#xBABD;&#xAC70;&#xC2A4; &#xBAA8;&#xC784;</p>

</li>
<li><p><a href="http://www.perladvent.org/">http://www.perladvent.org/</a></p>

<p>Perl &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; &#xB2EC;&#xB825;</p>

</li>
</ul>

<p>&#xB2E4;&#xC74C;&#xC740; Perl&#xC744; &#xB354; &#xAE4A;&#xAC8C; &#xACF5;&#xBD80;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC904; &#xC218; &#xC788;&#xB294; &#xD55C;&#xAD6D;&#xC5B4; &#xAD00;&#xB828; &#xC0AC;&#xC774;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;.</p>

<ul>

<li><p><a href="http://perl.kr/">http://perl.kr/</a></p>

<p>&#xD55C;&#xAD6D; Perl &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xACF5;&#xC2DD; &#xD3EC;&#xD138;</p>

</li>
<li><p><a href="http://doc.perl.kr/">http://doc.perl.kr/</a></p>

<p>Perl &#xBB38;&#xC11C; &#xD55C;&#xAE00;&#xD654; &#xD504;&#xB85C;&#xC81D;&#xD2B8;</p>

</li>
<li><p><a href="http://cafe.naver.com/perlstudy.cafe">http://cafe.naver.com/perlstudy.cafe</a></p>

<p>&#xB124;&#xC774;&#xBC84; Perl &#xCE74;&#xD398;</p>

</li>
<li><p><a href="http://www.perl.or.kr/">http://www.perl.or.kr/</a></p>

<p>&#xD55C;&#xAD6D; Perl &#xC0AC;&#xC6A9;&#xC790; &#xBAA8;&#xC784;</p>

</li>
<li><p><a href="http://advent.perl.kr">http://advent.perl.kr</a></p>

<p>Seoul.pm Perl &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; &#xB2EC;&#xB825; (2010 ~ 2012)</p>

</li>
<li><p><a href="http://gypark.pe.kr/wiki/Perl">http://gypark.pe.kr/wiki/Perl</a></p>

<p>GYPARK(Geunyoung Park)&#xC758; Perl &#xAD00;&#xB828; &#xD55C;&#xAE00; &#xBB38;&#xC11C; &#xC800;&#xC7A5;&#xC18C;</p>

</li>
<li><p><a href="http://seoul.pm.org">http://seoul.pm.org</a></p>

<p>Seoul.pm - &#xC11C;&#xC6B8; Perl &#xBABD;&#xAC70;&#xC2A4;</p>

</li>
</ul>

<h1 id="7">&#xB77C;&#xC774;&#xC13C;&#xC2A4;</h1>

<p><i>README</i> &#xD30C;&#xC77C;&#xC758; <b>&#39;LICENSING&#39;</b> &#xD56D;&#xBAA9;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC138;&#xC694;.</p>

<h1 id="AUTHORS">AUTHORS</h1>

<ul>

<li><p>Jarkko Hietaniemi &lt;jhi@iki.fi&gt;</p>

</li>
<li><p>&#xC2E0;&#xC815;&#xC2DD; &lt;jshin@mailaps.org&gt;</p>

</li>
<li><p>&#xAE40;&#xB3C4;&#xD615; &lt;keedi@cpan.org&gt;</p>

</li>
</ul>


</body>

</html>


